thanhnc25/STM32_DS1307_LCD_LowPower/USER/main.cpp
/**
 * \file main.cpp
 * \brief Ứng dụng chính: hiển thị thời gian DS1307 lên LCD, chỉnh bằng encoder + nút, và giao tiếp UART.
 * \details Mã đã được làm sạch: chuẩn hoá dấu ngoặc, tách ISR UART sang uart.cpp, kiểm tra thời gian sang ds1307.
 */
#include "stm32f10x.h"
#include "stm32f10x_pwr.h"
#include "stm32f10x_i2c.h"
#include <stdint.h>
#include <string.h>
#include <stdio.h>
#include "i2c.h"
#include "lcd_i2c.h"
#include "ds1307.h"
#include "Rotary.h"
#include "uart.h"
#include "gpio.h"
#include "math.h"

// FreeRTOS
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "semphr.h"
#include "event_groups.h"

// ----------------- Nguyên mẫu hàm (prototypes) -----------------
static void BusyDelayMs(uint32_t ms);
static void Task_LCD(void *arg);
enum class RtcCmdType : uint8_t;
struct RtcCmd;
static void Task_RTC(void *arg);
static void Bump_Field(Ds1307_Time &t, uint8_t field, int8_t dir);
static void Task_Input(void *arg);
static void Task_Power(void *arg);
static int parse_uint(const char *s, int maxlen);
static bool Parse_Set_Line(const char *line, Ds1307_Time *out);
static void Task_UART(void *arg);

// ----------------- Cấu hình chung -----------------
#define QUEUE_LEN_INPUT 16
#define MUTEX_WAIT_MS 50
#define DS1307_POLL_MS 500
#define LCD_REFRESH_MS 10
#define EDIT_BLINK_MS 120
#define INACTIVITY_SLEEP_MS 10000
#define HOLD_ENTER_EDIT_MS 2000

// Bit Event Group
#define EVT_USER_ACTIVE (1u << 0)
#define EVT_TIME_UPDATED (1u << 1)
#define EVT_EDIT_MODE (1u << 2)
#define EVT_SLEEPING (1u << 3)

// Không khởi tạo encoder toàn cục (tránh cấu hình NVIC trước khi set PriorityGroup trong main)
static RotaryEncoder *g_encoder = nullptr;

// GPIO nguồn LCD/RTC và nút PA0 dùng lớp GpioPin
static GpioPin g_pin_lcd(GPIOB, GPIO_Pin_1);
static GpioPin g_pin_rtc(GPIOB, GPIO_Pin_5);
static GpioPin g_pin_btn(GPIOA, GPIO_Pin_0);

// Nguồn LCD/RTC: PB1 (LCD), PB5 (RTC) – 1: bật, 0: tắt; PA0: nút (external pulldown -> active-high)
static inline void PowerPins_Init()
{
    g_pin_lcd.As_Output_Push_Pull();
    g_pin_lcd.Set_High();

    g_pin_rtc.As_Output_Push_Pull();
    g_pin_rtc.Set_High();
    // PA0 có kéo xuống bên ngoài -> để floating hoặc pull-down, đọc active-high
    g_pin_btn.As_Input_Floating();
    // Cấu hình ngưỡng giữ theo yêu cầu
    g_pin_btn.Button_Init(/*active_low=*/false, /*hold_ms=*/HOLD_ENTER_EDIT_MS);
}
static inline void LCD_Power(bool on)
{
    if (on)
        g_pin_lcd.Set_High();
    else
        g_pin_lcd.Set_Low();
}
static inline void RTC_Power(bool on)
{
    if (on)
        g_pin_rtc.Set_High();
    else
        g_pin_rtc.Set_Low();
}

// KHÔNG cấu hình EXTI cho PA0 khi khởi động; chỉ dùng cho WakeUp trước khi ngủ (PWR_WakeUpPin)

// ----------------- Biến/tài nguyên toàn cục -----------------
static EventGroupHandle_t g_evt;
static QueueHandle_t g_input_q;             // queue nhận delta int8 từ ISR encoder
static SemaphoreHandle_t g_i2c1_mtx;        // RTC
static SemaphoreHandle_t g_i2c2_mtx;        // LCD
static SemaphoreHandle_t g_state_mtx;       // bảo vệ state/time chỉnh
static TaskHandle_t g_power_task = nullptr; // handle để suspend/resume Task_Power khi vào/ra chế độ chỉnh
// Queue nhận dòng UART từ ISR được định nghĩa trong uart.cpp (g_uart_line_q)

// Kiểu UartLine đã được khai báo trong uart.h

static I2c g_i2c_lcd;
static I2c g_i2c_rtc;
static Lcd_I2c *g_lcd = nullptr;
static Ds1307 *g_rtc = nullptr;

static Ds1307_Time g_time;      // thời gian thực đọc được
static Ds1307_Time g_edit_time; // thời gian đang chỉnh 
// Thứ tự chỉnh mới: 0:hh,1:mm,2:ss,3:day,4:date,5:month,6:year
static uint8_t g_edit_field = 0;
static uint8_t g_in_edit = 0;
static Uart g_dbg_uart(USART1, 115200);

// ----------------- Tiện ích -----------------
static const char *DOW_Name(uint8_t day)
{
    switch (day)
    {
    case 1:
        return "CN"; // Chủ nhật
    case 2:
        return "T2";
    case 3:
        return "T3";
    case 4:
        return "T4";
    case 5:
        return "T5";
    case 6:
        return "T6";
    case 7:
        return "T7";
    default:
        return "--";
    }
}

// Hàm Days_In_Month đã chuyển sang ds1307.cpp -> Ds1307_Days_In_Month

// Không dùng EXTI0 cho xử lý nút trong runtime; dùng polling qua GpioPin

// ----------------- Nhiệm vụ -----------------
// Delay bận rộn ngắn dùng trong giai đoạn trước scheduler
static void BusyDelayMs(uint32_t ms)
{
    while (ms--)
    {
        volatile uint32_t n = SystemCoreClock / 8000U; // ~1ms
        while (n--)
        {
            __NOP();
        }
    }
}

// (Đã bỏ I2C2 bus recover để đơn giản hóa theo yêu cầu)
/** \brief Task hiển thị LCD: cập nhật 2 dòng thời gian/ngày, hỗ trợ nháy khi chỉnh. */
static void Task_LCD(void *arg)
{
    (void)arg;
    TickType_t last = xTaskGetTickCount();
    TickType_t last_blink = last;
    uint8_t blink = 0;
    static char last0[17] = {0};
    static char last1[17] = {0};
    // g_dbg_uart.Write("Task LCD start\r\n");
    for (;;)
    {
        // Chờ sự kiện TIME_UPDATED hoặc refresh theo chu kỳ để nháy
        (void)xEventGroupWaitBits(g_evt, EVT_TIME_UPDATED, pdTRUE, pdFALSE, pdMS_TO_TICKS(LCD_REFRESH_MS));

        Ds1307_Time t;
        uint8_t in_edit;
        uint8_t field;
        Ds1307_Time et;
        xSemaphoreTake(g_state_mtx, portMAX_DELAY);
        t = g_time;
        in_edit = g_in_edit;
        field = g_edit_field;
        et = g_edit_time;
        xSemaphoreGive(g_state_mtx);
        // Cập nhật trạng thái nhấp nháy theo chu kỳ riêng khi đang chỉnh
        TickType_t nowTick = xTaskGetTickCount();
        if (in_edit) {
            if ((nowTick - last_blink) >= pdMS_TO_TICKS(EDIT_BLINK_MS)) {
                blink ^= 1;
                last_blink = nowTick;
            }
        } else {
            blink = 0; // ngoài chế độ chỉnh: không nháy
        }

        // Tạo chuỗi căn giữa cho dòng 0 (DOW dd/mm/yyyy)
        if (xSemaphoreTake(g_i2c2_mtx, pdMS_TO_TICKS(MUTEX_WAIT_MS)) == pdTRUE)
        {
            const Ds1307_Time &src = in_edit ? et : t;
            uint16_t full_year = 2000 + src.year;
            const char *dow = DOW_Name(src.day);
            char line0[17];
            char temp0[17];
            // Các phần cần có thể nháy nếu đang chỉnh
            bool hide_day = in_edit && field == 3 && blink;
            bool hide_date = in_edit && field == 4 && blink;
            bool hide_month = in_edit && field == 5 && blink;
            bool hide_year = in_edit && field == 6 && blink;

            char dow_buf[3];
            dow_buf[0] = hide_day ? ' ' : dow[0];
            dow_buf[1] = hide_day ? ' ' : dow[1];
            dow_buf[2] = '\0';

