thanhnc25/STM32_DS1307_LCD_LowPower/USER/main.cpp
            // Date
            char date_buf[3];
            if (hide_date)
            {
                date_buf[0] = ' ';
                date_buf[1] = ' ';
                date_buf[2] = '\0';
            }
            else
            {
                date_buf[0] = (char)('0' + (src.date / 10));
                date_buf[1] = (char)('0' + (src.date % 10));
                date_buf[2] = '\0';
            }
            // Month
            char month_buf[3];
            if (hide_month)
            {
                month_buf[0] = ' ';
                month_buf[1] = ' ';
                month_buf[2] = '\0';
            }
            else
            {
                month_buf[0] = (char)('0' + (src.month / 10));
                month_buf[1] = (char)('0' + (src.month % 10));
                month_buf[2] = '\0';
            }
            // Year
            char year_buf[5];
            if (hide_year)
            {
                year_buf[0] = year_buf[1] = year_buf[2] = year_buf[3] = ' ';
                year_buf[4] = '\0';
            }
            else
            {
                year_buf[0] = (char)('0' + (full_year / 1000) % 10);
                year_buf[1] = (char)('0' + (full_year / 100) % 10);
                year_buf[2] = (char)('0' + (full_year / 10) % 10);
                year_buf[3] = (char)('0' + (full_year % 10));
                year_buf[4] = '\0';
            }

            // temp string (length variable)
            // Format: DOW space date '/' month '/' year
            snprintf(temp0, sizeof(temp0), "%s %s/%s/%s", dow_buf, date_buf, month_buf, year_buf);
            size_t len0 = strlen(temp0);
            size_t pad0 = (len0 < 16) ? (16 - len0) / 2 : 0;
            memset(line0, ' ', 16);
            line0[16] = '\0';
            for (size_t i = 0; i < len0 && (pad0 + i) < 16; i++)
                line0[pad0 + i] = temp0[i];
            if (strcmp(last0, line0) != 0) {
                g_lcd->Set_Cursor(0, 0);
                g_lcd->Print(line0);
                strncpy(last0, line0, 17);
            }

            // Dòng 1: hh:mm:ss căn giữa
            uint8_t hh = src.hours;
            uint8_t mm = src.minutes;
            uint8_t ss = src.seconds;
            bool hide_h = in_edit && field == 0 && blink;
            bool hide_m = in_edit && field == 1 && blink;
            bool hide_s = in_edit && field == 2 && blink;
            char h_buf[3];
            char m_buf[3];
            char s_buf[3];
            if (hide_h)
            {
                h_buf[0] = ' ';
                h_buf[1] = ' ';
                h_buf[2] = '\0';
            }
            else
            {
                h_buf[0] = (char)('0' + (hh / 10));
                h_buf[1] = (char)('0' + (hh % 10));
                h_buf[2] = '\0';
            }
            if (hide_m)
            {
                m_buf[0] = ' ';
                m_buf[1] = ' ';
                m_buf[2] = '\0';
            }
            else
            {
                m_buf[0] = (char)('0' + (mm / 10));
                m_buf[1] = (char)('0' + (mm % 10));
                m_buf[2] = '\0';
            }
            if (hide_s)
            {
                s_buf[0] = ' ';
                s_buf[1] = ' ';
                s_buf[2] = '\0';
            }
            else
            {
                s_buf[0] = (char)('0' + (ss / 10));
                s_buf[1] = (char)('0' + (ss % 10));
                s_buf[2] = '\0';
            }
            char temp1[17];
            snprintf(temp1, sizeof(temp1), "%s:%s:%s", h_buf, m_buf, s_buf);
            size_t len1 = strlen(temp1);
            size_t pad1 = (len1 < 16) ? (16 - len1) / 2 : 0;
            char line1[17];
            memset(line1, ' ', 16);
            line1[16] = '\0';
            for (size_t i = 0; i < len1 && (pad1 + i) < 16; i++)
                line1[pad1 + i] = temp1[i];
            if (strcmp(last1, line1) != 0) {
                g_lcd->Set_Cursor(0, 1);
                g_lcd->Print(line1);
                strncpy(last1, line1, 17);
            }

            xSemaphoreGive(g_i2c2_mtx);
        }

        vTaskDelayUntil(&last, pdMS_TO_TICKS(LCD_REFRESH_MS));
    }
}

// Lệnh cho Task RTC
enum class RtcCmdType : uint8_t
{
    NONE = 0,
    SET_TIME
};
struct RtcCmd
{
    RtcCmdType type;
    Ds1307_Time t;
};
static QueueHandle_t g_rtc_cmd_q;

/** \brief Task RTC: định kỳ đọc thời gian và xử lý lệnh SET_TIME từ queue. */
static void Task_RTC(void *arg)
{
    (void)arg;
    // g_dbg_uart.Write("Task RTC start\r\n");
    // Khởi tạo RTC và bắt đầu dao động
    if (xSemaphoreTake(g_i2c1_mtx, portMAX_DELAY) == pdTRUE)
    {
        g_rtc->Init();
        (void)g_rtc->Start();
        xSemaphoreGive(g_i2c1_mtx);
    }

    TickType_t last = xTaskGetTickCount();
    for (;;)
    {
        // Ưu tiên xử lý lệnh SET_TIME nếu có
        RtcCmd cmd;
        if (xQueueReceive(g_rtc_cmd_q, &cmd, 0) == pdPASS)
        {
            if (cmd.type == RtcCmdType::SET_TIME)
            {
                if (xSemaphoreTake(g_i2c1_mtx, pdMS_TO_TICKS(MUTEX_WAIT_MS)) == pdTRUE)
                {
                    (void)g_rtc->Set_Time(cmd.t);
                    xSemaphoreGive(g_i2c1_mtx);
                }
            }
        }

        // Đọc thời gian định kỳ (bỏ qua nếu đang ở chế độ chỉnh để tránh chớp hiển thị)
        uint8_t in_edit_snapshot = 0;
        xSemaphoreTake(g_state_mtx, portMAX_DELAY);
        in_edit_snapshot = g_in_edit;
        xSemaphoreGive(g_state_mtx);
        if (!in_edit_snapshot)
        {
            if (xSemaphoreTake(g_i2c1_mtx, pdMS_TO_TICKS(MUTEX_WAIT_MS)) == pdTRUE)
            {
                Ds1307_Time t;
                if (g_rtc->Get_Time(&t) == SUCCESS)
                {
                    xSemaphoreTake(g_state_mtx, portMAX_DELAY);
                    g_time = t;
                    xSemaphoreGive(g_state_mtx);
                    xEventGroupSetBits(g_evt, EVT_TIME_UPDATED);
                }
                xSemaphoreGive(g_i2c1_mtx);
            }
        }

        vTaskDelayUntil(&last, pdMS_TO_TICKS(DS1307_POLL_MS));
    }
}

