thanhnc25/STM32_DS1307_LCD_LowPower/USER/main.cpp
static void Bump_Field(Ds1307_Time &t, uint8_t field, int8_t dir)
{
    switch (field)
    {
    case 0: // hh
        t.hours = (uint8_t)((t.hours + (dir > 0 ? 1 : 23)) % 24);
        break;
    case 1: // mm
        t.minutes = (uint8_t)((t.minutes + (dir > 0 ? 1 : 59)) % 60);
        break;
    case 2: // ss
        t.seconds = (uint8_t)((t.seconds + (dir > 0 ? 1 : 59)) % 60);
        break;
    case 3: // day 1..7
    {
        int v = t.day + (dir > 0 ? 1 : -1);
        if (v < 1)
            v = 7;
        if (v > 7)
            v = 1;
        t.day = (uint8_t)v;
        break;
    }
    case 4: // date 1..31 (phụ thuộc tháng, năm)
    {
        uint8_t dim = Ds1307_Days_In_Month(t.month, t.year);
        int v = t.date + (dir > 0 ? 1 : -1);
        if (v < 1)
            v = dim;
        if (v > dim)
            v = 1;
        t.date = (uint8_t)v;
        break;
    }
    case 5: // month 1..12
    {
        int v = t.month + (dir > 0 ? 1 : -1);
        if (v < 1)
            v = 12;
        if (v > 12)
            v = 1;
        t.month = (uint8_t)v;
        uint8_t dim = Ds1307_Days_In_Month(t.month, t.year);
        if (t.date > dim)
            t.date = dim;
        break;
    }
    case 6: // year 0..99
        t.year = (uint8_t)((t.year + (dir > 0 ? 1 : 99)) % 100);
        break;
    }
}

/** \brief Task đọc đầu vào: nhận delta encoder từ queue + đọc nút (PRESS/HOLD). */
static void Task_Input(void *arg)
{
    (void)arg;
    TickType_t last_check = xTaskGetTickCount();
    // g_dbg_uart.Write("Task INPUT start\r\n");

    for (;;)
    {
        // Nhận delta từ ISR (mỗi phần tử queue là int8_t: +1 CW, -1 CCW)
        int8_t delta;
        if (xQueueReceive(g_input_q, &delta, 0) == pdPASS)
        {
            xEventGroupSetBits(g_evt, EVT_USER_ACTIVE);
            // if (delta > 0) g_dbg_uart.Write("ENC:CW\r\n");
            // else          g_dbg_uart.Write("ENC:CCW\r\n");
            if (g_in_edit)
            {
                xSemaphoreTake(g_state_mtx, portMAX_DELAY);
                Bump_Field(g_edit_time, g_edit_field, (delta > 0) ? +1 : -1);
                xSemaphoreGive(g_state_mtx);
            }
        }

        // 2) Poll nút PA0: trả về PRESS/HOLD theo thời gian giữa 2 lần đọc
        TickType_t now = xTaskGetTickCount();
        uint32_t dt_ms = (uint32_t)pdTICKS_TO_MS(now - last_check);
        if (dt_ms == 0)
            dt_ms = 1; // an toàn
        last_check = now;

        auto bev = g_pin_btn.Button_Check((uint16_t)dt_ms);
        if (bev == GpioPin::ButtonEvent::PRESS)
        {
            xEventGroupSetBits(g_evt, EVT_USER_ACTIVE);
            if (g_in_edit)
            {
                // Nhấn ngắn: chuyển field theo thứ tự hh->mm->ss->day->date->month->year
                xSemaphoreTake(g_state_mtx, portMAX_DELAY);
                g_edit_field = (uint8_t)((g_edit_field + 1) % 7);
                xSemaphoreGive(g_state_mtx);
            }
            // Không làm gì nếu chưa vào edit (yêu cầu: chỉ giữ mới vào edit)
        }
        else if (bev == GpioPin::ButtonEvent::HOLD)
        {
            xEventGroupSetBits(g_evt, EVT_USER_ACTIVE);
            if (!g_in_edit)
            {
                // Giữ để vào chỉnh giờ
                xSemaphoreTake(g_state_mtx, portMAX_DELAY);
                g_edit_time = g_time;
                g_edit_field = 0;
                g_in_edit = 1;
                xSemaphoreGive(g_state_mtx);
                xEventGroupSetBits(g_evt, EVT_EDIT_MODE);
                // Tạm dừng task POWER trong thời gian chỉnh để tránh tự standby
                if (g_power_task)
                {
                    vTaskSuspend(g_power_task);
                    // g_dbg_uart.Write("POWER suspended (edit)\r\n");
                }
            }
            else
            {
                // Đang chỉnh: giữ để gửi giờ ngay và thoát
                RtcCmd cmd;
                cmd.type = RtcCmdType::SET_TIME;
                xSemaphoreTake(g_state_mtx, portMAX_DELAY);
                // Cập nhật ngay thời gian toàn cục để tránh LCD hiển thị lại thời gian cũ trong 1 chu kỳ refresh
                cmd.t = g_edit_time;
                g_time = g_edit_time; // cập nhật tức thì
                g_in_edit = 0;
                g_edit_field = 0;
                xSemaphoreGive(g_state_mtx);
                xQueueSend(g_rtc_cmd_q, &cmd, 0);
                // Phát sự kiện TIME_UPDATED để Task_LCD render ngay giá trị vừa chỉnh, không chớp về thời gian cũ
                xEventGroupSetBits(g_evt, EVT_TIME_UPDATED);
                // Thoát chỉnh: resume lại task POWER
                if (g_power_task)
                {
                    vTaskResume(g_power_task);
                    // g_dbg_uart.Write("POWER resumed (exit edit)\r\n");
                }
            }
        }

        // Nhường CPU cho các task ưu tiên thấp hơn (tránh chiếm CPU liên tục)
        vTaskDelay(pdMS_TO_TICKS(10));
    }
}

/** \brief Task quản lý năng lượng: theo dõi inactivity và chuyển MCU vào STANDBY. */
static void Task_Power(void *arg)
{
    (void)arg;
    // Bật clock PWR cho chế độ tiết kiệm
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);
    // g_dbg_uart.Write("Task POWER start\r\n");

    for (;;)
    {
        // Chờ hoạt động người dùng, timeout 10s
        EventBits_t bits = xEventGroupWaitBits(g_evt, EVT_USER_ACTIVE, pdTRUE, pdFALSE, pdMS_TO_TICKS(INACTIVITY_SLEEP_MS));
        if ((bits & EVT_USER_ACTIVE) == 0)
        {
            // Không có tương tác -> vào STANDBY (tắt nguồn tải, deinit ngoại vi, rồi standby)
            xEventGroupSetBits(g_evt, EVT_SLEEPING);

            // vTaskSuspendAll();

            // Tắt backlight trước khi cắt nguồn
            if (g_lcd)
            {
                if (xSemaphoreTake(g_i2c2_mtx, pdMS_TO_TICKS(MUTEX_WAIT_MS)) == pdTRUE)
                {
                    g_lcd->Backlight(0);
                    xSemaphoreGive(g_i2c2_mtx);
                }
            }

            // Cắt nguồn cho LCD và RTC
            LCD_Power(false);
            RTC_Power(false);

            // Deinit I2C để giảm dòng rò
            g_i2c_lcd.Deinit();
            g_i2c_rtc.Deinit();

            // In debug trước khi vào Standby
            g_dbg_uart.Write("Enter STANDBY...\r\n");

