thanhnc25/STM32_DS1307_LCD_LowPower/USER/main.cpp
            // Chuẩn bị Standby: bật WakeUp pin (PA0 WKUP, sườn lên), xóa cờ
            RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);
            PWR_WakeUpPinCmd(ENABLE);
            PWR_ClearFlag(PWR_FLAG_WU);
            PWR_ClearFlag(PWR_FLAG_SB);

            // Vào Standby (sẽ reset khi thức dậy)
            PWR_EnterSTANDBYMode();

            // Không trở lại đây; nếu có, cứ resume để an toàn
            xTaskResumeAll();
        }
    }
}

// ----------------- UART: ISR và Task UART -----------------
// Định dạng bản tin đặt giờ: "SET,hh:mm:ss,dd/mm/yyyy,day\r\n" (day=1..7, CN=1)
static int parse_uint(const char *s, int maxlen)
{
    int v = 0;
    int i = 0;
    if (!s)
        return -1;
    while (i < maxlen && s[i] >= '0' && s[i] <= '9')
    {
        v = v * 10 + (s[i] - '0');
        ++i;
    }
    return (i == 0) ? -1 : v;
}

static bool Parse_Set_Line(const char *line, Ds1307_Time *out)
{
    if (!line || !out)
        return false;
    if (!(line[0] == 'S' && line[1] == 'E' && line[2] == 'T' && line[3] == ','))
        return false; // Prefix
    const char *p = line + 4;
    int hh = -1, mm = -1, ss = -1, dd = -1, mo = -1, yy = -1, day = -1;
    hh = parse_uint(p, 2);
    if (hh < 0)
        return false;
    while (*p && *p >= '0' && *p <= '9')
        ++p;
    if (*p++ != ':') return false;
    mm = parse_uint(p, 2);
    if (mm < 0)
        return false;
    while (*p && *p >= '0' && *p <= '9')
        ++p;
    if (*p++ != ':') return false;
    ss = parse_uint(p, 2);
    if (ss < 0)
        return false;
    while (*p && *p >= '0' && *p <= '9')
        ++p;
    if (*p++ != ',') return false;
    dd = parse_uint(p, 2);
    if (dd < 0)
        return false;
    while (*p && *p >= '0' && *p <= '9')
        ++p;
    if (*p++ != '/') return false;
    mo = parse_uint(p, 2);
    if (mo < 0)
        return false;
    while (*p && *p >= '0' && *p <= '9')
        ++p;
    if (*p++ != '/') return false;
    yy = parse_uint(p, 4);
    if (yy < 0)
        return false;
    while (*p && *p >= '0' && *p <= '9') ++p;
    if (*p++ != ',') return false;
    day = parse_uint(p, 1);
    if (day < 0) return false;

    uint8_t y2 = (yy >= 2000) ? (uint8_t)(yy - 2000) : (uint8_t)yy;
    Ds1307_Time tmp;
    tmp.hours = (uint8_t)hh;
    tmp.minutes = (uint8_t)mm;
    tmp.seconds = (uint8_t)ss;
    tmp.date = (uint8_t)dd;
    tmp.month = (uint8_t)mo;
    tmp.year = y2;
    tmp.day = (uint8_t)day;
    if (!Ds1307_Time_Is_Valid(&tmp))
        return false;
    *out = tmp;
    return true;
}

// ISR USART1 đã được chuyển sang uart.cpp

/** \brief Task UART: xử lý dòng nhận được và in thời gian định kỳ. */
static void Task_UART(void *arg)
{
    (void)arg;
    TickType_t last = xTaskGetTickCount();
    for (;;)
    {
        // Xử lý các dòng nhận được từ ISR
        UartLine line;
        while (xQueueReceive(g_uart_line_q, &line, 0) == pdPASS)
        {
            Ds1307_Time nt;
            if (Parse_Set_Line(line.buf, &nt))
            {
                RtcCmd cmd;
                cmd.type = RtcCmdType::SET_TIME;
                cmd.t = nt;
                (void)xQueueSend(g_rtc_cmd_q, &cmd, 0);
                g_dbg_uart.Write("OK\r\n");
                xEventGroupSetBits(g_evt, EVT_USER_ACTIVE);
            }
            else
            {
                g_dbg_uart.Write("ERR\r\n");
            }
        }

        // Cứ 1s in thời gian hiện tại lên UART
        if (xTaskGetTickCount() - last >= pdMS_TO_TICKS(1000))
        {
            last += pdMS_TO_TICKS(1000);
            Ds1307_Time t;
            xSemaphoreTake(g_state_mtx, portMAX_DELAY);
            t = g_time;
            xSemaphoreGive(g_state_mtx);
            char buf[48];
            uint16_t y = 2000 + t.year;
            snprintf(buf, sizeof(buf), "TIME,%02u:%02u:%02u,%02u/%02u/%04u,%u\r\n",
                     t.hours, t.minutes, t.seconds, t.date, t.month, y, t.day);
            g_dbg_uart.Write(buf);
        }

        vTaskDelay(pdMS_TO_TICKS(50));
    }
}

// ----------------- Khởi tạo và main -----------------

int main(void)
{
    // SystemInit() đã gọi từ startup. Cập nhật SystemCoreClock để LCD delay đúng nếu cần
    SystemCoreClockUpdate();
    // Đặt Priority Group đúng cho FreeRTOS (4 bit preemption, 0 bit subpriority)
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);
    // Nếu thức dậy từ Standby, in thông báo
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);
    if (PWR_GetFlagStatus(PWR_FLAG_SB) != RESET)
    {
        PWR_ClearFlag(PWR_FLAG_SB);
        PWR_ClearFlag(PWR_FLAG_WU);
        // g_dbg_uart.Write("Wake from STANDBY\r\n");
    }
    // g_dbg_uart.Write("BOOT\r\n");

    PowerPins_Init();
    BusyDelayMs(100); // cho nguồn LCD/RTC ổn định trước khi cấu hình tiếp
    // g_dbg_uart.Write("GPIO ok\r\n");

    // RTOS objects
    g_evt = xEventGroupCreate();
    g_input_q = xQueueCreate(QUEUE_LEN_INPUT, sizeof(int8_t));
    g_rtc_cmd_q = xQueueCreate(4, sizeof(RtcCmd));
    g_i2c1_mtx = xSemaphoreCreateMutex();
    g_i2c2_mtx = xSemaphoreCreateMutex();
    g_state_mtx = xSemaphoreCreateMutex();

    // Khởi tạo I2C và thiết bị ngoại vi
    g_i2c_lcd.Init(I2c::I2C_BUS2, 100000);
    g_i2c_rtc.Init(I2c::I2C_BUS1, 100000);
    // g_dbg_uart.Write("I2C1/I2C2 init ok\r\n");

    // LCD cố định địa chỉ 0x27 (không cần autodetect)
    static Lcd_I2c s_lcd(&g_i2c_lcd, 0x27, 16, 2);
    g_lcd = &s_lcd;
    g_lcd->Init();
    g_lcd->Backlight(1);
    g_lcd->Clear();
    // g_dbg_uart.Write("LCD inited @0x27\r\n");

    // Tạo đối tượng RTC (tránh nullptr)
    static Ds1307 s_rtc(&g_i2c_rtc);
    g_rtc = &s_rtc;
    // g_dbg_uart.Write("RTC obj ready\r\n");

    // Encoder trên PA1/PA2: khởi tạo SAU khi set PriorityGroup và tạo queue
    static RotaryEncoder s_encoder(GPIOA, GPIO_Pin_1, GPIO_Pin_2, 100, 4);
    g_encoder = &s_encoder;
    RotaryEncoder::Set_Event_Queue(g_input_q);

    // Queue UART line
    g_uart_line_q = xQueueCreate(8, sizeof(UartLine));
    // Bật interrupt RX cho USART1
    USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    NVIC_InitTypeDef nvic;
    nvic.NVIC_IRQChannel = USART1_IRQn;
    nvic.NVIC_IRQChannelPreemptionPriority = 10; // thấp hơn các IRQ quan trọng khác
    nvic.NVIC_IRQChannelSubPriority = 0;
    nvic.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&nvic);

    // Tạo task với stack thấp hơn để phù hợp heap mặc định
    BaseType_t ok = pdPASS;
    ok &= xTaskCreate(Task_LCD, "LCD", 192, nullptr, tskIDLE_PRIORITY + 2, nullptr);
    ok &= xTaskCreate(Task_RTC, "RTC", 192, nullptr, tskIDLE_PRIORITY + 2, nullptr);
    ok &= xTaskCreate(Task_Input, "INPUT", 256, nullptr, tskIDLE_PRIORITY + 3, nullptr);
    ok &= xTaskCreate(Task_Power, "POWER", 192, nullptr, tskIDLE_PRIORITY + 1, &g_power_task);
    ok &= xTaskCreate(Task_UART, "UART", 256, nullptr, tskIDLE_PRIORITY + 2, nullptr);

    vTaskStartScheduler();
    while (1)
    {        
    }
}


